# Используем официальный образ Python как базовый
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей и устанавливаем их
# Установка зависимостей до копирования всего кода позволяет Docker кэшировать этот шаг
# Если зависимости не меняются, последующие сборки будут быстрее
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь код проекта в рабочую директорию
COPY . .

# Собираем статические файлы. Это нужно сделать до запуска,
# чтобы Nginx мог их раздавать.
RUN python manage.py collectstatic --noinput

# Открываем порт, на котором будет работать Gunicorn
EXPOSE 8000

# Команда для запуска сервера Gunicorn, когда контейнер стартует
# --bind 0.0.0.0:8000 позволяет Gunicorn слушать запросы со всех IP-адресов
# settings.wsgi:application - это путь к твоему WSGI-приложению
CMD ["gunicorn", "--bind", "0.0.0.0:8000", "settings.wsgi:application"]